/**
 *
 * 文 件 名 : clearData.h
 * 创建日期 : 2015-7-30 10:18
 * 作    者 : 褚冰冰
 * 修改日期 : 2015-7-30 10:18
 * 当前版本 : 1.0
 * 功能描述 : 清除数据类封装
 * 修改记录 : 
 *            $Log: $
 *
 * Ver  Date        Author  Comments
 * ---  ----------  ------  -------------------------------------------
 * 001	2015-7-8	褚冰冰　清除数据类封装
 *
 **/
#ifndef CLEAR_DATA_H
#define CLEAR_DATA_H
#include "db/SDatabase.h"
#include "include_macdef.h"
//////////////////////////////////////////////////////////////////////////
// 名    称:  clearData
// 作    者:  褚冰冰
// 创建时间:  2015-7-30 10:30
// 描    述:  清除数据表中冗余数据
//////////////////////////////////////////////////////////////////////////
class clearData
{
public:
	clearData(void);
	~clearData(void);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  清除表中无用数据
	// 作    者:  褚冰冰
	// 创建时间:  2015-7-30 10:30
	// 参数说明:  @db为数据库连接对象指针
	// 返 回 值:  void
	//////////////////////////////////////////////////////////////////////////
	virtual void ClearUnusefulData(/*SDatabase * db*/);
};

#endif