/**
 *
 * 文 件 名 : BuddyWidget.h
 * 创建日期 : 2018-9-4 19:27
 * 作    者 : 邵凯田(skt001@163.com)
 * 修改日期 : $Date: $
 * 当前版本 : $Revision: $
 * 功能描述 : 用于外部伴随窗口，通过HWND句柄强制劫持窗口
 *            目标应用程序启用时，取自身的窗口句柄并通过UDP发送消息到本机的5678端口，内容为（hwnd可以为10进制和16进制，16进制时需要0x开头）：
 *            String str = "type=buddy_wnd;app_name="+app_name+";app_desc="+app_desc+";hwnd="+hwnd+";";
 * 修改记录 : 
 *            $Log: $
 *
 * Ver  Date        Author  Comments
 * ---  ----------  ------  -------------------------------------------
 * 001	2018-9-4	邵凯田　创建文件
 *
 **/
#ifndef __SKT_BUDDY_WIDGET_H__
#define __SKT_BUDDY_WIDGET_H__

#ifdef WIN32

#include <QtGui/QWidget>
#include "SSocket.h"
#include "SList.h"
#include "SString.h"
#include "SLog.h"
#include "SApi.h"
#include <windows.h>
#include "ssp_gui.h"
#include "ssp_gui_inc.h"

class SSP_GUI_EXPORT SBuddyWidget : public QWidget
{
	Q_OBJECT

public:
	SBuddyWidget(QWidget *parent = 0);
	~SBuddyWidget();

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  设置伴随应用的名称
	// 作    者:  邵凯田
	// 创建时间:  2018-9-4 20:14
	// 参数说明:  @app_name应用程序名称，必须与目标程序完全一致
	// 返 回 值:  void
	//////////////////////////////////////////////////////////////////////////
	void setBuddyAppName(char *app_name);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  设置伴随窗口句柄
	// 作    者:  邵凯田
	// 创建时间:  2018-9-4 20:15
	// 参数说明:  @hwnd为句柄
	// 返 回 值:  void
	//////////////////////////////////////////////////////////////////////////
	void setBuddyWnd(int hwnd);

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  取伴随窗口句柄
	// 作    者:  邵凯田
	// 创建时间:  2018-9-4 21:13
	// 参数说明:  
	// 返 回 值:  
	//////////////////////////////////////////////////////////////////////////
	int getBuddyWnd(){return m_iAppHWND;}

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  清除伴随窗口信息
	// 作    者:  邵凯田
	// 创建时间:  2018-9-4 20:17
	// 参数说明:  void
	// 返 回 值:  void
	//////////////////////////////////////////////////////////////////////////
	void cleanBuddyWnd();

	//////////////////////////////////////////////////////////////////////////
	// 描    述:  窗口大小改变时的事件处理，使伴随窗口跟着改变
	// 作    者:  邵凯田
	// 创建时间:  2018-9-4 20:17
	// 参数说明:  void
	// 返 回 值:  void
	//////////////////////////////////////////////////////////////////////////
	void onResize();

	virtual void resizeEvent( QResizeEvent * event );
private:
	//////////////////////////////////////////////////////////////////////////
	// 描    述:  UDP命令侦听线程
	// 作    者:  邵凯田
	// 创建时间:  2018-9-4 20:18
	// 参数说明:  void*
	// 返 回 值:  void*
	//////////////////////////////////////////////////////////////////////////
	static void* ThreadUdp(void *lp);

	SString m_sAppName;
	int m_iAppHWND;
};

#endif

#endif // __SKT_BUDDY_WIDGET_H__
